# Пользователь вводит целое число — количество собранных грибов. Программа должна вывести сообщение вида:

# "Мы собрали 1 гриб"
# "Мы собрали 2 гриба"
# "Мы собрали 5 грибов" То есть необходимо подобрать правильную форму слова "гриб" в зависимости от числа. Если введено отрицательное число — вывести "Input error".

# так как проверка на вывод окончания , то ограничилась до 15

count = input("Please enter count of picked mushrooms ")
count = int(count)

if 0 < count < 2:
    print(f"Мы собрали {count} гриб")
elif count == 0:
    print(f"Мы собрали {count} грибов")
elif 2 <= count <= 4:
    print(f"Мы собрали {count} гриба")
elif 5 <= count <= 15:
    print(f"Мы собрали {count}  грибов")
else:
    print("Input error")
print()